{
  "storage" : "model.espresso.weights",
  "properties" : {

  },
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_conv1",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 0,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "relu_conv1",
      "pad_l" : 0,
      "name" : "pool1",
      "top" : "pool1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire2_relu_squeeze1x1",
      "blob_weights" : 7,
      "K" : 64,
      "blob_biases" : 5,
      "name" : "fire2_squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "pool1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire2_relu_expand1x1",
      "blob_weights" : 11,
      "K" : 16,
      "blob_biases" : 9,
      "name" : "fire2_expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "fire2_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire2_relu_expand3x3",
      "blob_weights" : 15,
      "K" : 16,
      "blob_biases" : 13,
      "name" : "fire2_expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "fire2_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire2_concat",
      "type" : "concat",
      "name" : "fire2_concat",
      "bottom" : "fire2_relu_expand1x1,fire2_relu_expand3x3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire3_relu_squeeze1x1",
      "blob_weights" : 19,
      "K" : 128,
      "blob_biases" : 17,
      "name" : "fire3_squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "fire2_concat",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire3_relu_expand1x1",
      "blob_weights" : 23,
      "K" : 16,
      "blob_biases" : 21,
      "name" : "fire3_expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "fire3_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire3_relu_expand3x3",
      "blob_weights" : 27,
      "K" : 16,
      "blob_biases" : 25,
      "name" : "fire3_expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "fire3_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire3_concat",
      "type" : "concat",
      "name" : "fire3_concat",
      "bottom" : "fire3_relu_expand1x1,fire3_relu_expand3x3"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 0,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "fire3_concat",
      "pad_l" : 0,
      "name" : "pool3",
      "top" : "pool3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire4_relu_squeeze1x1",
      "blob_weights" : 31,
      "K" : 128,
      "blob_biases" : 29,
      "name" : "fire4_squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "pool3",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire4_relu_expand1x1",
      "blob_weights" : 35,
      "K" : 32,
      "blob_biases" : 33,
      "name" : "fire4_expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "fire4_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire4_relu_expand3x3",
      "blob_weights" : 39,
      "K" : 32,
      "blob_biases" : 37,
      "name" : "fire4_expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "fire4_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire4_concat",
      "type" : "concat",
      "name" : "fire4_concat",
      "bottom" : "fire4_relu_expand1x1,fire4_relu_expand3x3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire5_relu_squeeze1x1",
      "blob_weights" : 43,
      "K" : 256,
      "blob_biases" : 41,
      "name" : "fire5_squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "fire4_concat",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire5_relu_expand1x1",
      "blob_weights" : 47,
      "K" : 32,
      "blob_biases" : 45,
      "name" : "fire5_expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "fire5_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire5_relu_expand3x3",
      "blob_weights" : 51,
      "K" : 32,
      "blob_biases" : 49,
      "name" : "fire5_expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "fire5_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire5_concat",
      "type" : "concat",
      "name" : "fire5_concat",
      "bottom" : "fire5_relu_expand1x1,fire5_relu_expand3x3"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 0,
      "top_shape_style" : 2,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 0,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "fire5_concat",
      "pad_l" : 0,
      "name" : "pool5",
      "top" : "pool5"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire6_relu_squeeze1x1",
      "blob_weights" : 55,
      "K" : 256,
      "blob_biases" : 53,
      "name" : "fire6_squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "pool5",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire6_relu_expand1x1",
      "blob_weights" : 59,
      "K" : 48,
      "blob_biases" : 57,
      "name" : "fire6_expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "fire6_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire6_relu_expand3x3",
      "blob_weights" : 63,
      "K" : 48,
      "blob_biases" : 61,
      "name" : "fire6_expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "fire6_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire6_concat",
      "type" : "concat",
      "name" : "fire6_concat",
      "bottom" : "fire6_relu_expand1x1,fire6_relu_expand3x3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire7_relu_squeeze1x1",
      "blob_weights" : 67,
      "K" : 384,
      "blob_biases" : 65,
      "name" : "fire7_squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 48,
      "bottom" : "fire6_concat",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire7_relu_expand1x1",
      "blob_weights" : 71,
      "K" : 48,
      "blob_biases" : 69,
      "name" : "fire7_expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "fire7_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire7_relu_expand3x3",
      "blob_weights" : 75,
      "K" : 48,
      "blob_biases" : 73,
      "name" : "fire7_expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 192,
      "bottom" : "fire7_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire7_concat",
      "type" : "concat",
      "name" : "fire7_concat",
      "bottom" : "fire7_relu_expand1x1,fire7_relu_expand3x3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire8_relu_squeeze1x1",
      "blob_weights" : 79,
      "K" : 384,
      "blob_biases" : 77,
      "name" : "fire8_squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "fire7_concat",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire8_relu_expand1x1",
      "blob_weights" : 83,
      "K" : 64,
      "blob_biases" : 81,
      "name" : "fire8_expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "fire8_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire8_relu_expand3x3",
      "blob_weights" : 87,
      "K" : 64,
      "blob_biases" : 85,
      "name" : "fire8_expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "fire8_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire8_concat",
      "type" : "concat",
      "name" : "fire8_concat",
      "bottom" : "fire8_relu_expand1x1,fire8_relu_expand3x3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire9_relu_squeeze1x1",
      "blob_weights" : 91,
      "K" : 512,
      "blob_biases" : 89,
      "name" : "fire9_squeeze1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "fire8_concat",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire9_relu_expand1x1",
      "blob_weights" : 95,
      "K" : 64,
      "blob_biases" : 93,
      "name" : "fire9_expand1x1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "fire9_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "fire9_relu_expand3x3",
      "blob_weights" : 99,
      "K" : 64,
      "blob_biases" : 97,
      "name" : "fire9_expand3x3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "fire9_relu_squeeze1x1",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "fire9_concat",
      "type" : "concat",
      "name" : "fire9_concat",
      "bottom" : "fire9_relu_expand1x1,fire9_relu_expand3x3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "relu_conv10",
      "blob_weights" : 103,
      "K" : 512,
      "blob_biases" : 101,
      "name" : "conv10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1000,
      "bottom" : "fire9_concat",
      "weights" : {

      },
      "pad_mode" : 4,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "pool10",
      "size_x" : 14,
      "is_global" : 1,
      "top_shape_style" : 2,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 0,
      "type" : "pool",
      "name" : "pool10",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "relu_conv10",
      "weights" : {

      },
      "pad_mode" : 0,
      "size_y" : 14,
      "pad_value" : 0
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "flatten",
      "type" : "flatten",
      "name" : "flatten",
      "bottom" : "pool10"
    },
    {
      "nB" : 1000,
      "top" : "fullyconnected0",
      "has_biases" : 1,
      "weights" : {

      },
      "nC" : 22,
      "blob_weights" : 107,
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "flatten",
      "blob_biases" : 105,
      "has_tanh" : 0,
      "name" : "fullyconnected0",
      "has_prelu" : 0
    },
    {
      "C" : 2,
      "weights" : {

      },
      "top" : "labelProbability",
      "type" : "softmax",
      "name" : "labelProbability",
      "bottom" : "fullyconnected0"
    }
  ]
}